# Проверка гипотез по увеличению выручки в интернет-магазине — оценить результаты A/B теста

**Описание проекта:**

Используя данные интернет-магазина приоритезировать гипотезы, произвести оценку результатов A/B-тестирования различными методами

**Интрументы:**

Python - библиотеки pandas, numpy, matplotlib.pyplot, scipy, seaborn, A/B-тестирование, проверка статистических гипотез, приоритизация гипотез, фреймворк ICE, RICE

**Вывод:**

Проведена приоритизация гипотез по фреймворкам ICE и RICE. Затем провел анализ
результатов A/B-теста, построил графики кумулятивной выручки, среднего чека,
конверсии по группам, а затем посчитал статистическую значимость различий конверсий
и средних чеков по сырым и очищенным данным. На основании анализа мной было
принято решение о нецелесообразности дальнейшего проведения теста.
